dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMcdslight_bf.h
/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN17 */
#define IFX_MCDSLIGHT_ACCEN0_EN17_OFF (17u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN18 */
#define IFX_MCDSLIGHT_ACCEN0_EN18_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN18 */
#define IFX_MCDSLIGHT_ACCEN0_EN18_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN18 */
#define IFX_MCDSLIGHT_ACCEN0_EN18_OFF (18u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN19 */
#define IFX_MCDSLIGHT_ACCEN0_EN19_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN19 */
#define IFX_MCDSLIGHT_ACCEN0_EN19_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN19 */
#define IFX_MCDSLIGHT_ACCEN0_EN19_OFF (19u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN20 */
#define IFX_MCDSLIGHT_ACCEN0_EN20_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN20 */
#define IFX_MCDSLIGHT_ACCEN0_EN20_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN20 */
#define IFX_MCDSLIGHT_ACCEN0_EN20_OFF (20u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN21 */
#define IFX_MCDSLIGHT_ACCEN0_EN21_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN21 */
#define IFX_MCDSLIGHT_ACCEN0_EN21_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN21 */
#define IFX_MCDSLIGHT_ACCEN0_EN21_OFF (21u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN22 */
#define IFX_MCDSLIGHT_ACCEN0_EN22_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN22 */
#define IFX_MCDSLIGHT_ACCEN0_EN22_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN22 */
#define IFX_MCDSLIGHT_ACCEN0_EN22_OFF (22u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN23 */
#define IFX_MCDSLIGHT_ACCEN0_EN23_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN23 */
#define IFX_MCDSLIGHT_ACCEN0_EN23_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN23 */
#define IFX_MCDSLIGHT_ACCEN0_EN23_OFF (23u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN24 */
#define IFX_MCDSLIGHT_ACCEN0_EN24_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN24 */
#define IFX_MCDSLIGHT_ACCEN0_EN24_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN24 */
#define IFX_MCDSLIGHT_ACCEN0_EN24_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN25 */
#define IFX_MCDSLIGHT_ACCEN0_EN25_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN25 */
#define IFX_MCDSLIGHT_ACCEN0_EN25_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN25 */
#define IFX_MCDSLIGHT_ACCEN0_EN25_OFF (25u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN26 */
#define IFX_MCDSLIGHT_ACCEN0_EN26_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN26 */
#define IFX_MCDSLIGHT_ACCEN0_EN26_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN26 */
#define IFX_MCDSLIGHT_ACCEN0_EN26_OFF (26u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN27 */
#define IFX_MCDSLIGHT_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN27 */
#define IFX_MCDSLIGHT_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN27 */
#define IFX_MCDSLIGHT_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN28 */
#define IFX_MCDSLIGHT_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN28 */
#define IFX_MCDSLIGHT_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN28 */
#define IFX_MCDSLIGHT_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN29 */
#define IFX_MCDSLIGHT_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN29 */
#define IFX_MCDSLIGHT_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN29 */
#define IFX_MCDSLIGHT_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN30 */
#define IFX_MCDSLIGHT_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN30 */
#define IFX_MCDSLIGHT_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN30 */
#define IFX_MCDSLIGHT_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_MCDSLIGHT_ACCEN0_Bits.EN31 */
#define IFX_MCDSLIGHT_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_ACCEN0_Bits.EN31 */
#define IFX_MCDSLIGHT_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_ACCEN0_Bits.EN31 */
#define IFX_MCDSLIGHT_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_FIFONOW_Bits.NOW */
#define IFX_MCDSLIGHT_FIFONOW_NOW_LEN (16u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFONOW_Bits.NOW */
#define IFX_MCDSLIGHT_FIFONOW_NOW_MSK (0xffffu)

/** \brief Offset for Ifx_MCDSLIGHT_FIFONOW_Bits.NOW */
#define IFX_MCDSLIGHT_FIFONOW_NOW_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOBOT_Bits.BOTTOM */
#define IFX_MCDSLIGHT_FIFOBOT_BOTTOM_LEN (9u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOBOT_Bits.BOTTOM */
#define IFX_MCDSLIGHT_FIFOBOT_BOTTOM_MSK (0x1ffu)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOBOT_Bits.BOTTOM */
#define IFX_MCDSLIGHT_FIFOBOT_BOTTOM_OFF (12u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOPRE_Bits.PRE */
#define IFX_MCDSLIGHT_FIFOPRE_PRE_LEN (16u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOPRE_Bits.PRE */
#define IFX_MCDSLIGHT_FIFOPRE_PRE_MSK (0xffffu)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOPRE_Bits.PRE */
#define IFX_MCDSLIGHT_FIFOPRE_PRE_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOTOP_Bits.TOP */
#define IFX_MCDSLIGHT_FIFOTOP_TOP_LEN (16u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOTOP_Bits.TOP */
#define IFX_MCDSLIGHT_FIFOTOP_TOP_MSK (0xffffu)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOTOP_Bits.TOP */
#define IFX_MCDSLIGHT_FIFOTOP_TOP_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRG */
#define IFX_MCDSLIGHT_FIFOCTL_TRG_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRG */
#define IFX_MCDSLIGHT_FIFOCTL_TRG_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.TRG */
#define IFX_MCDSLIGHT_FIFOCTL_TRG_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.FFE */
#define IFX_MCDSLIGHT_FIFOCTL_FFE_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.FFE */
#define IFX_MCDSLIGHT_FIFOCTL_FFE_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.FFE */
#define IFX_MCDSLIGHT_FIFOCTL_FFE_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.TME */
#define IFX_MCDSLIGHT_FIFOCTL_TME_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.TME */
#define IFX_MCDSLIGHT_FIFOCTL_TME_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.TME */
#define IFX_MCDSLIGHT_FIFOCTL_TME_OFF (2u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.DMC_MODE */
#define IFX_MCDSLIGHT_FIFOCTL_DMC_MODE_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.DMC_MODE */
#define IFX_MCDSLIGHT_FIFOCTL_DMC_MODE_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_FIFOCTL_Bits.DMC_MODE */
#define IFX_MCDSLIGHT_FIFOCTL_DMC_MODE_OFF (7u)

/** \brief Length for Ifx_MCDSLIGHT_FIFOCTL_Bits.DMC_MODE_P */
#define IFX_MCDSLIGHT_FIFOCTL_DMC_MODE_P_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_FIFOCTL_Bits.DMC_MODE_P */
#define IFX_MCDSLIGHT_FIFOCTL_DMC_MODE_P_MSK (0x1u)

