dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMcdslight_bf.h
/** \brief Length for Ifx_MCDSLIGHT_MCXACT_Bits.LV2 */
#define IFX_MCDSLIGHT_MCXACT_LV2_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MCXACT_Bits.LV2 */
#define IFX_MCDSLIGHT_MCXACT_LV2_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MCXACT_Bits.LV2 */
#define IFX_MCDSLIGHT_MCXACT_LV2_OFF (23u)

/** \brief Length for Ifx_MCDSLIGHT_MCXACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_MCXACT_AIS3_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_MCXACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_MCXACT_AIS3_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_MCXACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_MCXACT_AIS3_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_MCXACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_MCXACT_AIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_MCXACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_MCXACT_AIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_MCXACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_MCXACT_AIQ3_OFF (29u)

/** \brief Length for Ifx_MCDSLIGHT_MCXACT_Bits.LV3 */
#define IFX_MCDSLIGHT_MCXACT_LV3_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MCXACT_Bits.LV3 */
#define IFX_MCDSLIGHT_MCXACT_LV3_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MCXACT_Bits.LV3 */
#define IFX_MCDSLIGHT_MCXACT_LV3_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CCL_Bits.INC0 */
#define IFX_MCDSLIGHT_MCX_CCL_INC0_LEN (7u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CCL_Bits.INC0 */
#define IFX_MCDSLIGHT_MCX_CCL_INC0_MSK (0x7fu)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CCL_Bits.INC0 */
#define IFX_MCDSLIGHT_MCX_CCL_INC0_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CCL_Bits.ILV0 */
#define IFX_MCDSLIGHT_MCX_CCL_ILV0_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CCL_Bits.ILV0 */
#define IFX_MCDSLIGHT_MCX_CCL_ILV0_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CCL_Bits.ILV0 */
#define IFX_MCDSLIGHT_MCX_CCL_ILV0_OFF (7u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLR0 */
#define IFX_MCDSLIGHT_MCX_CCL_CLR0_LEN (6u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLR0 */
#define IFX_MCDSLIGHT_MCX_CCL_CLR0_MSK (0x3fu)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLR0 */
#define IFX_MCDSLIGHT_MCX_CCL_CLR0_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLV0 */
#define IFX_MCDSLIGHT_MCX_CCL_CLV0_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLV0 */
#define IFX_MCDSLIGHT_MCX_CCL_CLV0_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLV0 */
#define IFX_MCDSLIGHT_MCX_CCL_CLV0_OFF (15u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CCL_Bits.INC1 */
#define IFX_MCDSLIGHT_MCX_CCL_INC1_LEN (7u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CCL_Bits.INC1 */
#define IFX_MCDSLIGHT_MCX_CCL_INC1_MSK (0x7fu)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CCL_Bits.INC1 */
#define IFX_MCDSLIGHT_MCX_CCL_INC1_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CCL_Bits.ILV1 */
#define IFX_MCDSLIGHT_MCX_CCL_ILV1_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CCL_Bits.ILV1 */
#define IFX_MCDSLIGHT_MCX_CCL_ILV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CCL_Bits.ILV1 */
#define IFX_MCDSLIGHT_MCX_CCL_ILV1_OFF (23u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLR1 */
#define IFX_MCDSLIGHT_MCX_CCL_CLR1_LEN (6u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLR1 */
#define IFX_MCDSLIGHT_MCX_CCL_CLR1_MSK (0x3fu)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLR1 */
#define IFX_MCDSLIGHT_MCX_CCL_CLR1_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLV1 */
#define IFX_MCDSLIGHT_MCX_CCL_CLV1_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLV1 */
#define IFX_MCDSLIGHT_MCX_CCL_CLV1_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CCL_Bits.CLV1 */
#define IFX_MCDSLIGHT_MCX_CCL_CLV1_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_LMT_Bits.LIMIT */
#define IFX_MCDSLIGHT_MCX_LMT_LIMIT_LEN (16u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_LMT_Bits.LIMIT */
#define IFX_MCDSLIGHT_MCX_LMT_LIMIT_MSK (0xffffu)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_LMT_Bits.LIMIT */
#define IFX_MCDSLIGHT_MCX_LMT_LIMIT_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_LMT_Bits.MOD0 */
#define IFX_MCDSLIGHT_MCX_LMT_MOD0_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_LMT_Bits.MOD0 */
#define IFX_MCDSLIGHT_MCX_LMT_MOD0_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_LMT_Bits.MOD0 */
#define IFX_MCDSLIGHT_MCX_LMT_MOD0_OFF (30u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_LMT_Bits.MOD1 */
#define IFX_MCDSLIGHT_MCX_LMT_MOD1_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_LMT_Bits.MOD1 */
#define IFX_MCDSLIGHT_MCX_LMT_MOD1_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_LMT_Bits.MOD1 */
#define IFX_MCDSLIGHT_MCX_LMT_MOD1_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_MCX_CNT_Bits.COUNT */
#define IFX_MCDSLIGHT_MCX_CNT_COUNT_LEN (16u)

/** \brief Mask for Ifx_MCDSLIGHT_MCX_CNT_Bits.COUNT */
#define IFX_MCDSLIGHT_MCX_CNT_COUNT_MSK (0xffffu)

/** \brief Offset for Ifx_MCDSLIGHT_MCX_CNT_Bits.COUNT */
#define IFX_MCDSLIGHT_MCX_CNT_COUNT_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.SUS */
#define IFX_MCDSLIGHT_TCXDCSTS_SUS_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.SUS */
#define IFX_MCDSLIGHT_TCXDCSTS_SUS_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.SUS */
#define IFX_MCDSLIGHT_TCXDCSTS_SUS_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.IDLE */
#define IFX_MCDSLIGHT_TCXDCSTS_IDLE_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.IDLE */
#define IFX_MCDSLIGHT_TCXDCSTS_IDLE_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.IDLE */
#define IFX_MCDSLIGHT_TCXDCSTS_IDLE_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.HALT */
#define IFX_MCDSLIGHT_TCXDCSTS_HALT_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.HALT */
#define IFX_MCDSLIGHT_TCXDCSTS_HALT_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.HALT */
#define IFX_MCDSLIGHT_TCXDCSTS_HALT_OFF (2u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.ISR */
#define IFX_MCDSLIGHT_TCXDCSTS_ISR_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.ISR */
#define IFX_MCDSLIGHT_TCXDCSTS_ISR_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.ISR */
#define IFX_MCDSLIGHT_TCXDCSTS_ISR_OFF (3u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.HBRK */
#define IFX_MCDSLIGHT_TCXDCSTS_HBRK_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.HBRK */
#define IFX_MCDSLIGHT_TCXDCSTS_HBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.HBRK */
#define IFX_MCDSLIGHT_TCXDCSTS_HBRK_OFF (4u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.SBRK */
#define IFX_MCDSLIGHT_TCXDCSTS_SBRK_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.SBRK */
#define IFX_MCDSLIGHT_TCXDCSTS_SBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.SBRK */
#define IFX_MCDSLIGHT_TCXDCSTS_SBRK_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TCXDCSTS_Bits.IEN */
#define IFX_MCDSLIGHT_TCXDCSTS_IEN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXDCSTS_Bits.IEN */
#define IFX_MCDSLIGHT_TCXDCSTS_IEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXDCSTS_Bits.IEN */
#define IFX_MCDSLIGHT_TCXDCSTS_IEN_OFF (7u)

