dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMcdslight_bf.h
/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_TCXACT_AIS3_LEN (5u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_TCXACT_AIS3_MSK (0x1fu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.AIS3 */
#define IFX_MCDSLIGHT_TCXACT_AIS3_OFF (24u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_TCXACT_AIQ3_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_TCXACT_AIQ3_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.AIQ3 */
#define IFX_MCDSLIGHT_TCXACT_AIQ3_OFF (29u)

/** \brief Length for Ifx_MCDSLIGHT_TCXACT_Bits.LV3 */
#define IFX_MCDSLIGHT_TCXACT_LV3_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXACT_Bits.LV3 */
#define IFX_MCDSLIGHT_TCXACT_LV3_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCXACT_Bits.LV3 */
#define IFX_MCDSLIGHT_TCXACT_LV3_OFF (31u)

/** \brief Length for Ifx_MCDSLIGHT_TCXIP_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXIP_BND_BOUND_LEN (31u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXIP_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXIP_BND_BOUND_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXIP_BND_Bits.BOUND */
#define IFX_MCDSLIGHT_TCXIP_BND_BOUND_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXIP_RNG_RANGE_LEN (31u)

/** \brief Mask for Ifx_MCDSLIGHT_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXIP_RNG_RANGE_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCXIP_RNG_Bits.RANGE */
#define IFX_MCDSLIGHT_TCXIP_RNG_RANGE_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.SUS */
#define IFX_MCDSLIGHT_TCYDCSTS_SUS_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.SUS */
#define IFX_MCDSLIGHT_TCYDCSTS_SUS_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.SUS */
#define IFX_MCDSLIGHT_TCYDCSTS_SUS_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.IDLE */
#define IFX_MCDSLIGHT_TCYDCSTS_IDLE_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.IDLE */
#define IFX_MCDSLIGHT_TCYDCSTS_IDLE_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.IDLE */
#define IFX_MCDSLIGHT_TCYDCSTS_IDLE_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.HALT */
#define IFX_MCDSLIGHT_TCYDCSTS_HALT_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.HALT */
#define IFX_MCDSLIGHT_TCYDCSTS_HALT_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.HALT */
#define IFX_MCDSLIGHT_TCYDCSTS_HALT_OFF (2u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.ISR */
#define IFX_MCDSLIGHT_TCYDCSTS_ISR_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.ISR */
#define IFX_MCDSLIGHT_TCYDCSTS_ISR_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.ISR */
#define IFX_MCDSLIGHT_TCYDCSTS_ISR_OFF (3u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.HBRK */
#define IFX_MCDSLIGHT_TCYDCSTS_HBRK_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.HBRK */
#define IFX_MCDSLIGHT_TCYDCSTS_HBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.HBRK */
#define IFX_MCDSLIGHT_TCYDCSTS_HBRK_OFF (4u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.SBRK */
#define IFX_MCDSLIGHT_TCYDCSTS_SBRK_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.SBRK */
#define IFX_MCDSLIGHT_TCYDCSTS_SBRK_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.SBRK */
#define IFX_MCDSLIGHT_TCYDCSTS_SBRK_OFF (5u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.IEN */
#define IFX_MCDSLIGHT_TCYDCSTS_IEN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.IEN */
#define IFX_MCDSLIGHT_TCYDCSTS_IEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.IEN */
#define IFX_MCDSLIGHT_TCYDCSTS_IEN_OFF (7u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.DBGEN */
#define IFX_MCDSLIGHT_TCYDCSTS_DBGEN_LEN (1u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.DBGEN */
#define IFX_MCDSLIGHT_TCYDCSTS_DBGEN_MSK (0x1u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.DBGEN */
#define IFX_MCDSLIGHT_TCYDCSTS_DBGEN_OFF (8u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.CLKDIV */
#define IFX_MCDSLIGHT_TCYDCSTS_CLKDIV_LEN (2u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.CLKDIV */
#define IFX_MCDSLIGHT_TCYDCSTS_CLKDIV_MSK (0x3u)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.CLKDIV */
#define IFX_MCDSLIGHT_TCYDCSTS_CLKDIV_OFF (9u)

/** \brief Length for Ifx_MCDSLIGHT_TCYDCSTS_Bits.NESTED_ISR */
#define IFX_MCDSLIGHT_TCYDCSTS_NESTED_ISR_LEN (4u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYDCSTS_Bits.NESTED_ISR */
#define IFX_MCDSLIGHT_TCYDCSTS_NESTED_ISR_MSK (0xfu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYDCSTS_Bits.NESTED_ISR */
#define IFX_MCDSLIGHT_TCYDCSTS_NESTED_ISR_OFF (11u)

/** \brief Length for Ifx_MCDSLIGHT_TCYCIP_Bits.CURRENT */
#define IFX_MCDSLIGHT_TCYCIP_CURRENT_LEN (31u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYCIP_Bits.CURRENT */
#define IFX_MCDSLIGHT_TCYCIP_CURRENT_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYCIP_Bits.CURRENT */
#define IFX_MCDSLIGHT_TCYCIP_CURRENT_OFF (1u)

/** \brief Length for Ifx_MCDSLIGHT_TCYCFT_Bits.VSHRT_FCT */
#define IFX_MCDSLIGHT_TCYCFT_VSHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYCFT_Bits.VSHRT_FCT */
#define IFX_MCDSLIGHT_TCYCFT_VSHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYCFT_Bits.VSHRT_FCT */
#define IFX_MCDSLIGHT_TCYCFT_VSHRT_FCT_OFF (0u)

/** \brief Length for Ifx_MCDSLIGHT_TCYCFT_Bits.SHRT_FCT */
#define IFX_MCDSLIGHT_TCYCFT_SHRT_FCT_LEN (10u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYCFT_Bits.SHRT_FCT */
#define IFX_MCDSLIGHT_TCYCFT_SHRT_FCT_MSK (0x3ffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYCFT_Bits.SHRT_FCT */
#define IFX_MCDSLIGHT_TCYCFT_SHRT_FCT_OFF (16u)

/** \brief Length for Ifx_MCDSLIGHT_TCYPALLUTD_Bits.DATA */
#define IFX_MCDSLIGHT_TCYPALLUTD_DATA_LEN (32u)

/** \brief Mask for Ifx_MCDSLIGHT_TCYPALLUTD_Bits.DATA */
#define IFX_MCDSLIGHT_TCYPALLUTD_DATA_MSK (0xffffffffu)

/** \brief Offset for Ifx_MCDSLIGHT_TCYPALLUTD_Bits.DATA */
#define IFX_MCDSLIGHT_TCYPALLUTD_DATA_OFF (0u)

